#put any key/value pairs here
my.plugin.name=SAML 2.0 Plugin
saml-login-servlet.name=SAML 2.0 Authentication Servlet
saml-login-servlet.description=The SAML 2.0 SSO Authentication Servlet
saml-custom-login-servlet.name=SAML 2.0 Custom Authentication Servlet
saml-custom-login-servlet.description=The SAML 2.0 SSO Custom Authentication Servlet
saml-logout-servlet.name=SAML 2.0 Logout Servlet
saml-logout-servlet.description=The SAML 2.0 SSO Logout Servlet
saml-metadata-servlet.name=SAML 2.0 Metadata Servlet
saml-metadata-servlet.description=The SAML 2.0 Service Provider's Metadata

#Admin configuration screen
saml2plugin.admin.title=\u041f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u044b \u0440\u0430\u0441\u0448\u0438\u0440\u0435\u043d\u0438\u044f SAML 2.0 SSO
saml2plugin.admin.field.loginUrl=Login URL
saml2plugin.admin.field.loginUrl.desc=IdP URL \u0434\u043b\u044f \u0432\u0445\u043e\u0434\u0430
saml2plugin.admin.field.logoutUrl=Logout URL
saml2plugin.admin.field.logoutUrl.desc=IdP URL \u0434\u043b\u044f \u0432\u044b\u0445\u043e\u0434\u0430 (\u043d\u0435\u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u043e)
saml2plugin.admin.field.x509Certificate=X.509 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442
saml2plugin.admin.field.x509Certificate.desc=IdP X.509 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442
saml2plugin.admin.field.entityId=Entity ID
saml2plugin.admin.field.entityId.desc=IdP EntityID
saml2plugin.admin.field.uidAttribute=UID
saml2plugin.admin.field.uidAttribute.desc=\u041d\u0430\u0437\u0432\u0430\u043d\u0438\u0435 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430, \u043a\u043e\u0442\u043e\u0440\u043e\u0435 \u0431\u0443\u0434\u0435\u0442 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u043e \u0434\u043b\u044f \u0438\u043c\u0435\u043d\u0438 \u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u0435\u043b\u044f (UID). 'NameID' \u0437\u043d\u0430\u0447\u0438\u0442 SAML NameID, \u0432\u043c\u0435\u0441\u0442\u043e \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430. \u0422\u0430\u043a\u0436\u0435 \u043c\u043e\u0436\u043d\u043e \u0443\u043a\u0430\u0437\u0430\u0442\u044c \u043d\u0435\u0441\u043a\u043e\u043b\u044c\u043a\u043e \u0443\u0438\u0434\u043e\u0432, \u043d\u0430\u043f\u0440\u0438\u043c\u0435\u0440, 'cn,mail'
saml2plugin.admin.field.nameAttribute=\u041f\u043e\u043b\u043d\u043e\u0435 \u0438\u043c\u044f
saml2plugin.admin.field.nameAttribute.desc=\u041d\u0430\u0438\u043c\u0435\u043d\u043e\u0432\u0430\u043d\u0438\u0435 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430, \u043a\u043e\u0442\u043e\u0440\u043e\u0435 \u0431\u0443\u0434\u0435\u0442 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u043e \u0434\u043b\u044f \u043f\u043e\u043b\u043d\u043e\u0433\u043e \u0438\u043c\u0435\u043d\u0438. \u041c\u043e\u0436\u043d\u043e \u0443\u043a\u0430\u0437\u0430\u0442\u044c \u043d\u0435\u0441\u043a\u043e\u043b\u044c\u043a\u043e \u0441\u0432\u043e\u0439\u0441\u0442\u0432 \u0432 \u0444\u043e\u0440\u043c\u0430\u0442\u0435 '%s %s:sn,givenname'), \u043e\u043d\u0438 \u0431\u0443\u0434\u0443\u0442 \u043e\u0442\u0444\u043e\u0440\u043c\u0430\u0442\u0438\u0440\u043e\u0432\u0430\u043d\u044b \u0432 \u0441\u043e\u043e\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0438\u0438 \u0441 \u0444\u043e\u0440\u043c\u0430\u0442\u043e\u043c '%s %s'
saml2plugin.admin.field.mailAttribute=E-mail
saml2plugin.admin.field.mailAttribute.desc=\u041d\u0430\u0438\u043c\u0435\u043d\u043e\u0432\u0430\u043d\u0438\u0435 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430, \u043a\u043e\u0442\u043e\u0440\u043e\u0435 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u0435\u0442\u0441\u044f \u0434\u043b\u044f \u043f\u043e\u043b\u044f e-mail
saml2plugin.admin.field.autoCreateUser=\u0410\u0432\u0442\u043e\u043c\u0430\u0442\u0438\u0447\u0435\u0441\u043a\u0438 \u0441\u043e\u0437\u0434\u0430\u0432\u0430\u0442\u044c \u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u0435\u043b\u0435\u0439
saml2plugin.admin.field.autoCreateUser.desc=\u0415\u0441\u043b\u0438 \u0444\u043b\u0430\u0436\u043e\u043a \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d, \u043f\u0440\u0438 \u0443\u0441\u043f\u0435\u0448\u043d\u043e\u043c \u0432\u0445\u043e\u0434\u0435 \u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u0435\u043b\u044c \u0431\u0443\u0434\u0435\u0442 \u0441\u043e\u0437\u0434\u0430\u043d \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u044f \u0434\u0430\u043d\u043d\u044b\u0435 \u043e\u0442\u0432\u0435\u0442\u0430 SAML
saml2plugin.admin.field.removeFromGroups=\u0423\u0434\u0430\u043b\u0438\u0442\u044c \u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u0435\u043b\u044f \u0438\u0437 \u0432\u0441\u0435\u0445 \u0433\u0440\u0443\u043f\u043f \u043f\u043e\u0441\u043b\u0435 \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u0438
saml2plugin.admin.field.removeFromGroups.desc=\u0415\u0441\u043b\u0438 \u0444\u043b\u0430\u0436\u043e\u043a \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d, \u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u0435\u043b\u044c \u043d\u0435 \u0431\u0443\u0434\u0435\u0442 \u0441\u0432\u044f\u0437\u0430\u043d \u043d\u0438 \u0441 \u043e\u0434\u043d\u043e\u0439 \u0433\u0440\u0443\u043f\u043f\u043e\u0439 \u043f\u043e\u0441\u043b\u0435 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f
saml2plugin.admin.field.idpRequired=\u041f\u0440\u0438\u043d\u0443\u0434\u0438\u0442\u0435\u043b\u044c\u043d\u044b\u0439 \u0432\u0445\u043e\u0434 SSO
saml2plugin.admin.field.idpRequired.desc=\u0415\u0441\u043b\u0438 \u0444\u043b\u0430\u0436\u043e\u043a \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d, \u0432\u0441\u0435 \u043f\u043e\u043f\u044b\u0442\u043a\u0438 \u0432\u0445\u043e\u0434\u0430 \u0431\u0443\u0434\u0443\u0442 \u0447\u0435\u0440\u0435\u0437 SSO. \u0412\u0430\u043c \u043d\u0443\u0436\u043d\u043e \u0432\u0441\u0435 \u0442\u0449\u0430\u0442\u0435\u043b\u044c\u043d\u043e \u043f\u0435\u0440\u0435\u043f\u0440\u043e\u0432\u0435\u0440\u0438\u0442\u044c \u043f\u0435\u0440\u0435\u0434 \u0442\u0435\u043c \u043a\u0430\u043a \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u044c \u044d\u0442\u043e\u0442 \u0444\u043b\u0430\u0436\u043e\u043a, \u0438\u043d\u0430\u0447\u0435 \u043d\u0438\u043a\u0442\u043e \u043d\u0435 \u0441\u043c\u043e\u0436\u0435\u0442 \u0432\u043e\u0439\u0442\u0438.
saml2plugin.admin.message.saved=\u041d\u0430\u0441\u0442\u0440\u043e\u0439\u043a\u0438 \u0443\u0441\u043f\u0435\u0448\u043d\u043e \u0441\u043e\u0445\u0440\u0430\u043d\u0435\u043d\u044b
saml2Plugin.admin.loginUrlEmpty=Login URL \u043f\u0443\u0441\u0442\u043e
saml2Plugin.admin.loginUrlInvalid=Login URL \u0437\u0430\u0434\u0430\u043d\u043e \u043d\u0435\u0432\u0435\u0440\u043d\u043e
saml2Plugin.admin.logoutUrlEmpty=Logout URL \u043f\u0443\u0441\u0442\u043e
saml2Plugin.admin.logoutUrlInvalid=Logout URL \u0437\u0430\u0434\u0430\u043d\u043e \u043d\u0435\u0432\u0435\u0440\u043d\u043e
saml2Plugin.admin.entityIdEmpty=Entity ID \u043f\u0443\u0441\u0442\u043e
saml2Plugin.admin.uidAttributeEmpty=UID \u043f\u0443\u0441\u0442\u043e
saml2Plugin.admin.nameAttributeEmpty=\u041f\u043e\u043b\u043d\u043e\u0435 \u0438\u043c\u044f \u043f\u0443\u0441\u0442\u043e
saml2Plugin.admin.mailAttributeEmpty=E-mail \u043f\u0443\u0441\u0442\u043e
saml2Plugin.admin.x509CertificateEmpty=X.509 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u043f\u0443\u0441\u0442
saml2Plugin.admin.x509CertificateInvalid=X.509 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0437\u0430\u0434\u0430\u043d \u043d\u0435\u0432\u0435\u0440\u043d\u043e
saml2plugin.admin.field.samlEndpoint=SAML Endpoint
saml2plugin.admin.field.samlEndpoint.desc=SAML ServiceProvider URL, \u0434\u043b\u044f \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u0438\u044f \u0432 \u043a\u043e\u043d\u0444\u0438\u0433\u0443\u0440\u0430\u0446\u0438\u0438 \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0435 IdP
saml2plugin.admin.field.copy=\u041a\u043e\u043f\u0438\u0440\u043e\u0432\u0430\u0442\u044c
saml2plugin.admin.endpoint-copied=URL \u0431\u044b\u043b\u043e \u0441\u043a\u043e\u043f\u0438\u0440\u043e\u0432\u0430\u043d\u043e \u0432 \u0431\u0443\u0444\u0435\u0440 \u043e\u0431\u043c\u0435\u043d\u0430
saml2Plugin.admin.notAdministrator=\u0414\u043e\u0441\u0442\u0443\u043f \u0437\u0430\u043a\u0440\u044b\u0442: \u0414\u043e\u043b\u0436\u043d\u044b \u0431\u044b\u0442\u044c \u043f\u0440\u0430\u0432\u0430 \u0441\u0438\u0441\u0442\u0435\u043c\u043d\u043e\u0433\u043e \u0430\u0434\u043c\u0438\u043d\u0438\u0441\u0442\u0440\u0430\u0442\u043e\u0440\u0430
saml2Plugin.admin.newIdP=\u041d\u043e\u0432\u044b\u0439 IdentityProvider
saml2Plugin.admin.commonProperties=\u041e\u0431\u0449\u0438\u0435 \u043d\u0430\u0441\u0442\u0440\u043e\u0439\u043a\u0438
saml2Plugin.admin.idpSettings=IdentityProvider
save.name=Готово

saml2plugin.config=\u041d\u0430\u0441\u0442\u0440\u043e\u0439\u043a\u0438 \u0440\u0430\u0441\u0448\u0438\u0440\u0435\u043d\u0438\u044f SAML 2.0 SSO
